OpenFOAM-2.3.0/tutorials/combustion/fireFoam/les/flameSpreadWaterSuppressionPanel/constant/pyrolysisRegion/reactions
species
(
    wood
    char
);

gaseousSpecies
(
    gas
);

reactions
{
    charReaction
    {
        type        irreversibleArrheniusSolidReaction;
        reaction    "wood^4.86 = char + gas";
        A           7.83e10;
        Ta          15274.57;
        Tcrit       400;
    }
}
